LEARNING DATA ANALYTICS IN PYTHON WITH THE HELP OF CHATGPT

__________________________________________________________________________________________________________________________________________________________

PROJECT 
: Handling Missing Data â€” Streaming Platform Analytics ðŸŽ¥

ðŸ“Š Dataset Description

Youâ€™re working with a fictional streaming platformâ€™s dataset that contains missing values in various columns.
Your task is to explore, clean, and analyze the data

In [2]:
import pandas as pd
import numpy as np

Creating Dataset

In [3]:
show=pd.DataFrame({'TITLE':['Attack on Titan','Another','Lord of Mysteries','Classroom of Elites','Devils line'],'GENRE':['Action','Mystery','Fantasy','Psychological','horror'],'RELEASE YEAR':[2013,2015,2025,np.nan,np.nan],'RATING':[9.2,8.5,np.nan,np.nan,7.8],'EPISODES':[30,24,np.nan,12,12],'NATIONALITY':['Japan','Japan','China','Japan','Japan']},index=['A','B','C','D','E'])

In [5]:
showss=show.copy()
show_duplicate=show.copy() #This line was added only to demonstrate how duplicate handling works and to help you understand the differences between the various functions applied to the dataset. You donâ€™t need to actually create multiple duplicates.

Displaying dataset 'showss'

In [4]:
showss

,TITLE,GENRE,RELEASE YEAR,RATING,EPISODES,NATIONALITY
A,Attack on Titan,Action,2013.0,9.2,30.0,Japan
B,Another,Mystery,2015.0,8.5,24.0,Japan
C,Lord of Mysteries,Fantasy,2025.0,NaN,NaN,China
D,Classroom of Elites,Psychological,NaN,NaN,12.0,Japan
E,Devils line,horror,NaN,7.8,12.0,Japan

ðŸ“˜ SECTION 1: IDENTIFY AND EXPLORE MISSING DATA

1. Display the dataset and observe where missing values appear.

In [6]:
showss.isnull() # checking for missing values
#true indicates missing value

   TITLE  GENRE  RELEASE YEAR  RATING  EPISODES  NATIONALITY
A  False  False         False   False     False        False
B  False  False         False   False     False        False
C  False  False         False    True      True        False
D  False  False          True    True     False        False
E  False  False          True   False     False        False

2. Find the total number of missing values in each column.

In [7]:
showss.isnull().sum() #summing up boolean values, true=1, false=0

TITLE           0
GENRE           0
RELEASE YEAR    2
RATING          2
EPISODES        1
NATIONALITY     0
dtype: int64

3. Find how many rows are completely clean (no missing values).

In [8]:
showss.dropna(axis=0) #dropping rows with missing values

             TITLE    GENRE  RELEASE YEAR  RATING  EPISODES NATIONALITY
A  Attack on Titan   Action        2013.0     9.2      30.0       Japan
B          Another  Mystery        2015.0     8.5      24.0       Japan

to find how many rows with no null values.

In [9]:
len(showss.dropna(axis=0)) # to find how many rows with no null values.

2

quick note :
- df.isnull() â†’ shows where nulls are

- df.notnull() â†’ shows where data exists

- df.dropna() â†’ gives you rows without any nulls

- len(df.dropna()) â†’ tells how many such rows there are

ðŸ§¹ SECTION 2: HANDLE MISSING DATA (CLEANING METHODS)

1. Drop columns that contain null values.

In [48]:
shows_col=show_duplicate.dropna(axis=1) #dropping columns with missing values

2. Check and print how the shape of the DataFrame changed after dropping.

In [49]:
print("Before dropping the columns" ,show.shape)
print("After dropping the columns" ,shows_col.shape)

Before dropping the columns (5, 6)
After dropping the columns (5, 3)

3. Replace all missing values 
- RATING with the median of that column.
- RELEASE YEAR with the mean of that column (rounded).

noteðŸ’¡:df['column'] = df['column'].fillna(df['column'].median()) â†’ fill nulls in one column

In [50]:
show_duplicate

,TITLE,GENRE,RELEASE YEAR,RATING,EPISODES,NATIONALITY
A,Attack on Titan,Action,2013.0,9.2,30.0,Japan
B,Another,Mystery,2015.0,8.5,24.0,Japan
C,Lord of Mysteries,Fantasy,2025.0,NaN,NaN,China
D,Classroom of Elites,Psychological,NaN,NaN,12.0,Japan
E,Devils line,horror,NaN,7.8,12.0,Japan

In [51]:
show_duplicate['RATING'] = show_duplicate['RATING'].fillna(show_duplicate['RATING'].median())
show_duplicate

,TITLE,GENRE,RELEASE YEAR,RATING,EPISODES,NATIONALITY
A,Attack on Titan,Action,2013.0,9.2,30.0,Japan
B,Another,Mystery,2015.0,8.5,24.0,Japan
C,Lord of Mysteries,Fantasy,2025.0,8.5,NaN,China
D,Classroom of Elites,Psychological,NaN,8.5,12.0,Japan
E,Devils line,horror,NaN,7.8,12.0,Japan

In [52]:
show_duplicate['RELEASE YEAR']=show_duplicate['RELEASE YEAR'].fillna(show_duplicate['RELEASE YEAR'].mean()).astype(int)
show_duplicate

,TITLE,GENRE,RELEASE YEAR,RATING,EPISODES,NATIONALITY
A,Attack on Titan,Action,2013,9.2,30.0,Japan
B,Another,Mystery,2015,8.5,24.0,Japan
C,Lord of Mysteries,Fantasy,2025,8.5,NaN,China
D,Classroom of Elites,Psychological,2017,8.5,12.0,Japan
E,Devils line,horror,2017,7.8,12.0,Japan

4. Perform a forward fill and backward fill, then compare the difference.

In [53]:
forward= show_duplicate.ffill()
forward

,TITLE,GENRE,RELEASE YEAR,RATING,EPISODES,NATIONALITY
A,Attack on Titan,Action,2013,9.2,30.0,Japan
B,Another,Mystery,2015,8.5,24.0,Japan
C,Lord of Mysteries,Fantasy,2025,8.5,24.0,China
D,Classroom of Elites,Psychological,2017,8.5,12.0,Japan
E,Devils line,horror,2017,7.8,12.0,Japan

In [54]:
backward = show_duplicate.bfill()
backward

,TITLE,GENRE,RELEASE YEAR,RATING,EPISODES,NATIONALITY
A,Attack on Titan,Action,2013,9.2,30.0,Japan
B,Another,Mystery,2015,8.5,24.0,Japan
C,Lord of Mysteries,Fantasy,2025,8.5,12.0,China
D,Classroom of Elites,Psychological,2017,8.5,12.0,Japan
E,Devils line,horror,2017,7.8,12.0,Japan

In [55]:
forward.compare(backward)

  EPISODES
      self other
C     24.0  12.0

ðŸ“Š SECTION 3: ANALYZE AFTER CLEANING

1. Display summary statistics (.describe()) after filling missing values.

In [56]:
show_duplicate.describe()

       RELEASE YEAR    RATING  EPISODES
count      5.000000  5.000000       4.0
mean    2017.400000  8.500000      19.5
std        4.560702  0.494975       9.0
min     2013.000000  7.800000      12.0
25%     2015.000000  8.500000      12.0
50%     2017.000000  8.500000      18.0
75%     2017.000000  8.500000      25.5
max     2025.000000  9.200000      30.0

2. Compare the filled DataFrame with the original using .compare().

In [58]:
show.compare(show_duplicate)

  RELEASE YEAR         RATING
          self   other   self other
C          NaN     NaN    NaN   8.5
D          NaN  2017.0    NaN   8.5
E          NaN  2017.0    NaN   NaN

3. Verify that no missing values remain using .isnull().sum().

In [64]:
show_duplicate=show_duplicate.ffill()

In [65]:
show_duplicate

,TITLE,GENRE,RELEASE YEAR,RATING,EPISODES,NATIONALITY
A,Attack on Titan,Action,2013,9.2,30.0,Japan
B,Another,Mystery,2015,8.5,24.0,Japan
C,Lord of Mysteries,Fantasy,2025,8.5,24.0,China
D,Classroom of Elites,Psychological,2017,8.5,12.0,Japan
E,Devils line,horror,2017,7.8,12.0,Japan

In [66]:
show_duplicate.isnull().sum()

TITLE           0
GENRE           0
RELEASE YEAR    0
RATING          0
EPISODES        0
NATIONALITY     0
dtype: int64

Save the cleaned DataFrame as show_cleaned.csv.

In [67]:
show_duplicate.to_csv('show_cleaned.csv')